#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Tue Dec 19 11:07:25 2023

add_design D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/rom_sin_wave/rom_sin_wave.idf
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
add_design D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/pll_clock_125m/pll_clock_125m.idf
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/grid_display.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/hdmi_test.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/iic_dri.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/ms72xx_ctl.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/ms7200_ctl.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/ms7210_ctl.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/pattern_vg.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/sync_vg.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/timing_gen_xy.v"
add_design "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/source/wav_display.v"
add_design D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/pll/pll.idf
add_design D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/pll_adda/pll_adda.idf
add_design D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/rom1024x8/rom1024x8.idf
remove_design -force D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/rom1024x8/rom1024x8.idf
add_design D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ipcore/ram1024x8/ram1024x8.idf
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/ad9280_ad9708_HDMI.fdc"
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/synthesize/ad_da_hdmi_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"D:/admin/desktop/AD_DA_50H/da_ad_HDMI/synthesize/ad_da_hdmi_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/admin/desktop/AD_DA_50H/da_ad_HDMI/synthesize/ad_da_hdmi_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -5 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/01_Learning_projects/PDS_projects/SINGAL/AD_DA_50H/da_ad_HDMI/source/tb_hdmi.v"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_netlist 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/AD_DA_50H/AD9708_sawtooth_wave/ipcore/rom_sawtooth_wave/rom_sawtooth_wave.idf"
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Key_Debounce.v"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Kwy_Debounce_fix.v"
remove_design -verilog "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Kwy_Debounce_fix.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Key_Debounce_fix.v"
add_simulation "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/tb_key_debounce.v"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Key_Debounce_fix.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/AD_DA_50H/AD9708_square_wave/ipcore/rom_square_wave/rom_square_wave.idf"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/AD_DA_50H/AD9708_triangular_wave/ipcore/rom_triangular_wave/rom_triangular_wave.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/fft_demo_00.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/ipsxe_fft_exp_rom.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/example_design/rtl/ipsxe_fft_frame_chk.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/example_design/rtl/ipsxe_fft_frame_gen.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/example_design/rtl/ipsxe_fft_onboard_top.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/example_design/rtl/ipsxe_fft_sync_arstn.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/pnr/core_only/ipsxe_fft_core_only.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/distram_sdpram/ipsxe_fft_distram_sdpram.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/distram_sreg/ipsxe_fft_distram_sreg.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/distram_sreg/rtl/ipsxe_fft_distributed_sdpram_v1_2.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/distram_sreg/rtl/ipsxe_fft_distributed_shiftregister_v1_3.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/drm_sdpram/ipsxe_fft_drm_sdpram_18k.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/drm_sdpram/ipsxe_fft_drm_sdpram_36k.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/drm_sdpram/rtl/drm_init_param.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/drm_sdpram/rtl/ipml_sdpram_v1_7_drm.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/rtl/synplify/ipsxe_fft_core_v1_1_vpAll.vp"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ipsxe_fft_onboard_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/ipcore/fifo_ram_fft/fifo_ram_fft.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/ipcore/pll_fft_256/pll_fft_256.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad9708_sin_wave
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/ipcore/pll_multi/pll_multi.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/FFT_256/max_finder.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/ipcore/pll_multi/pll_multi.idf
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Pic/picorv32.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Pic/picosoc/gpio.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Pic/picosoc/picosoc.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Pic/picosoc/simpleuart.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/ipcore/pll_pico/pll_pico.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/01_Learning_projects/PDS_projects/SINGAL/HDMI/source/Pic/top_tb.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ad_da_hdmi_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
