#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Jan  3 17:34:52 2024

add_design "D:/admin/desktop/AD_DA_50H/AD9708_sawtooth_wave/source/top.v"
add_design D:/admin/desktop/AD_DA_50H/AD9708_sawtooth_wave/ipcore/ad_clock_125m/ad_clock_125m.idf
add_design D:/admin/desktop/AD_DA_50H/AD9708_sawtooth_wave/ipcore/rom_sawtooth_wave/rom_sawtooth_wave.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "D:/admin/desktop/AD_DA_50H/AD9708_sawtooth_wave/source/ad_9708_wave.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
