#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Mon Oct 28 19:29:22 2024

add_design D:/pango_prj/logic_test/ipcore/PLL_4/PLL_4.idf
add_design "D:/pango_prj/logic_test/source/pll_test.v"
add_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
add_design "D:/pango_prj/logic_test/source/source/glitch_free_clock_mux.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_design -force -verilog "D:/pango_prj/logic_test/source/source/glitch_free_clock_mux.v"
add_design "D:/pango_prj/logic_test/source/glitch_free_clock_mux.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
add_design "D:/pango_prj/logic_test/source/time_select.v"
remove_design -verilog "D:/pango_prj/logic_test/source/glitch_free_clock_mux.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
add_design D:/pango_prj/logic_test/ipcore/RAM_0/RAM_0.idf
remove_design -verilog "D:/pango_prj/logic_test/source/time_select.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_design -verilog "D:/pango_prj/logic_test/source/pll_test.v"
add_design "D:/pango_prj/logic_test/source/pll_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
add_design "D:/pango_prj/crtl_1.08/source/Key_Debounce.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
add_design "D:/pango_prj/logic_test/source/glitch_free.v"
add_design "D:/pango_prj/logic_test/source/sampler.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
add_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_design -verilog "D:/pango_prj/logic_test/source/sampler.v"
add_design "D:/pango_prj/logic_test/source/sampler.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
add_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
remove_simulation -force "D:/pango_prj/logic_test/source/tb_pll.v"
add_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
add_simulation "D:/pango_prj/logic_test/source/tb_pll_test.v"
remove_design -verilog "D:/pango_prj/logic_test/source/sampler.v"
add_design "D:/pango_prj/logic_test/source/sampler_copy.v"
remove_design -verilog "D:/pango_prj/logic_test/source/sampler_copy.v"
add_design "D:/pango_prj/logic_test/source/sampler.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
add_constraint "D:/pango_prj/logic_test/source/logic_analyzer.fdc"
add_simulation "D:/pango_prj/logic_test/source/tb_glitch.v"
remove_simulation "D:/pango_prj/logic_test/source/tb_pll_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module pll_test
remove_simulation "D:/pango_prj/logic_test/source/tb_glitch.v"
add_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
remove_design -verilog "D:/pango_prj/logic_test/source/pll_test.v"
add_design "D:/pango_prj/logic_test/source/logic_analyzer.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module logic_analyzer
remove_simulation "D:/pango_prj/logic_test/source/tb_pll.v"
add_simulation "D:/pango_prj/logic_test/source/tb_test.v"
add_design "D:/pango_prj/logic_test/source/LA_test.v"
add_design "D:/pango_prj/crtl_1.08/source/ctrl_test.v"
add_design "D:/pango_prj/logic_test/source/rom_sawtooth_wave/rom_sawtooth_wave.idf"
add_design "D:/pango_prj/logic_test/source/rom_sin_wave/rom_sin_wave.idf"
add_design "D:/pango_prj/logic_test/source/rom_square_wave/rom_square_wave.idf"
add_design "D:/pango_prj/logic_test/source/rom_triangular_wave/rom_triangular_wave.idf"
add_design "D:/pango_prj/logic_test/source/ad_clock_125m/ad_clock_125m.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/01_Learning_projects/PDS_projects/SINGAL/logic_test/synthesize/LA_test_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/01_Learning_projects/PDS_projects/SINGAL/logic_test/ipcore/pll_/pll_.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/logic_test/source/ctrl_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
remove_design -force -verilog "D:/01_Learning_projects/PDS_projects/SINGAL/crtl_1.08/source/ctrl_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/01_Learning_projects/PDS_projects/SINGAL/logic_test/source/ctrl_test.v"
add_design "D:/01_Learning_projects/PDS_projects/SINGAL/logic_test/source/Signal_generators.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module LA_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
