#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Mon Jan  8 17:20:25 2024

add_constraint "D:/admin/desktop/AD_DA_50H/AD9708_triangular_wave/source/ad_9708_wave.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
